# Application Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Application Methods
Application Class See Also
---
The Application type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CopyModel | Copies an existing model to a new file. Overwriting a file of the same name is allowed. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| ExtractPartAtomFromFamilyFile | Writes a PartAtom XML from the contents of a family file. |
| GetAssets | Gets all the Assets of the specified type. |
| GetFailureDefinitionRegistry | Returns the instance of FailureDefinitionRegistry. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLibraryPaths | Returns path information identifying where Revit searches for content. |
| GetRevitServerNetworkHosts | Gets the list of all Revit Server Network hosts in current session. |
| GetSystemsAnalysisWorkflowNames | Returns names for systems analysis workflows. |
| GetSystemsAnalysisWorkflows | Returns name and path information identifying systems analysis workflow files. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWorksharingCentralGUID | Gets the worksharing central GUID of the given server-based model. |
| IsJournalPlaying | Determines if the application is currently in journal playback mode. |
| IsValidThickness | Checks if the input value is valid to be supplied as a thickness (for an extrusion, or blend, or wall layer, or similar geometric construct). |
| NewFamilyDocument | New family document, including family, titleblock, and annotation symbol |
| NewProjectDocument(String) | New project document |
| NewProjectDocument(UnitSystem) | Creates a new project document with no template file specified. |
| NewProjectTemplateDocument | New project template document |
| OpenDocumentFile(String) | Opens a document from disk. |
| OpenDocumentFile(ModelPath, OpenOptions) | Opens a document from disk or cloud. |
| OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) | Opens a document from disk or cloud. |
| OpenIFCDocument(String) | Opens an IFC document from disk using default options. |
| OpenIFCDocument(String, IFCImportOptions) | Opens an IFC document from disk using custom options. |
| OpenSharedParameterFile | Enables access to shared parameter groups and definitions that are maintained on disk. |
| PurgeReleasedAPIObjects | Explicitly purges all API objects that have been released but are still awaiting to be finalized |
| RegisterFailuresProcessor | Replaces Revit's default user interface (if present) with alternative handling for all warnings and errors (including those not generated by your application) for the rest of the Revit session; if your application is not prepared to respond to all warnings and errors, consider use of IFailuresPreprocessor (in your opened Transaction) or the FailuresProcessing event instead of this interface. |
| SetLibraryPaths | Sets path information identifying where Revit searches for content. |
| SetSystemsAnalysisWorkflows | Sets name and path information identifying systems analysis workflow files. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| UpdateRenderAppearanceLibrary | Updates the stored render appearance library, giving the Revit session access to any new RPC content. |
| WriteJournalComment | Writes a comment to the Revit journal file. |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace